Mengganti nama (label) kolom pada Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [2]:
n_rows = 5
n_cols = 5

cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size =(n_rows,n_cols)) , columns = cols)

df

   A  B  C  D  E
0  8  8  1  9  2
1  6  1  8  1  2
2  1  1  4  8  9
3  9  6  8  2  1
4  3  8  8  4  2

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [6]:
df.rename(columns = {'C':'hobi'})

   A  B  hobi  D  E
0  8  8     1  9  2
1  6  1     8  1  2
2  1  1     4  8  9
3  9  6     8  2  1
4  3  8     8  4  2

In [7]:
df.rename(columns = {'C':'Hobi','A':'Nama', 'B':'Alamat'})

   Nama  Alamat  Hobi  D  E
0     8       8     1  9  2
1     6       1     8  1  2
2     1       1     4  8  9
3     9       6     8  2  1
4     3       8     8  4  2